package ua.step.example.part1.practica;

/**
 * 
 * Задача "Синоптик"
 *
 */
public class Task02
{
    @SuppressWarnings("unused")
    public static void main(String[] args)
    {
        String[] mounts = { "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь",
                "Октябрь", "Нофябрь", "Декабрь" };

        // максимальная температура днем
        int[] dayMax = { -1, 1, 5, 12, 19, 24, 26, 26, 21, 15, 8, 4 };


        // минимальная температура ночью
        int[] nightMin = { -10, -4, 0, 6, 12, 16, 18, 17, 13, 8, 3, -11 };

        /*
         * FIXME Вывести название месяца в котором перепадом температур между
         * днем и ночью максимален. Вывести перепад температур
         */
    }
}