package ua.step.example.part1.practica;

/**
 * 
 * Задача "Синоптик"
 *
 */
public class Task00
{
    @SuppressWarnings("unused")
    public static void main(String[] args)
    {
        String[] mounts = { "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь",
                "Октябрь", "Нофябрь", "Декабрь" };

        // средняя температура в месяце
        float[] average = { -1.7f, -1f, 2.6f, 9f, 15.1f, 19.4f, 21.4f, 21.2f, 17.1f, 11.1f, 5.9f, 1.4f };
        // FIXME Выведи среднюю температуру в виде таблички, в которой месяца разбиты по кварталам
        /*
         * Средняя температура: 
         * Январь: -1.700000 Февраль: -1.000000 Март: 2.600000 
         * Апрель: 9.000000 Май: 15.100000 Июнь: 19.400000 
         * Июль:  21.400000 Август: 21.200001 Сентябрь: 17.100000 
         * Октябрь: 11.100000 Нофябрь: 5.900000 Декабрь: 1.400000
         */
        int k=0;
        for(int i = 0; i < 12; i++)
            {k++;
            System.out.printf("%s: %.6f ",mounts[i],average[i]);
            if (k%3==0)
        System.out.println();}



        }

   }
